app/views/posts/tag.html.erb

        </h2>
        <% post.tag_list.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('food'))