app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  ORDER BY plays DESC  [["published", "f"]]
---
  def index
    @posts = Post.where(:published => true).order('plays DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."featured" = ?  ORDER BY created_at DESC  [["featured", "t"]]
---
  def featured
    @posts = Post.where(:featured => true).order('created_at DESC')

SELECT "posts".* FROM "posts" WHERE "posts"."published" = ?  ORDER BY plays DESC  [["published", "f"]]
---
   def admin
    @posts = Post.where(:published => false).order('plays DESC')

UPDATE "posts" SET "plays" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["plays", 1], ["updated_at", "2015-08-17 11:27:28.278892"], ["id", 5]]
---
  def plays

    @post.plays = @post.plays.to_i + 1
    @post.save

INSERT INTO "posts" ("title", "body", "summary", "image", "url", "published", "hidden", "featured", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id



    if post_params[:hidden] == "true"
    # embeddly  here
    embedly_api = Embedly::API.new :key => 'a2fb48b9541743e5af42f58f216a4f6d'
    obj = embedly_api.oembed :url => @post.url

    @post.plays = 0
    @post.title = obj[0].title
    @post.summary =  obj[0].description
    # @post.thumbnail = obj[0].thumbnail_url
    # @leaf.domain = obj[0].provider_name
    end
    @post.published = false

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "url" = ?, "audio" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["url", "http://www.motherjones.com/tom-philpott/2015/06/less-meat-smil"], ["audio", "v1439718563/heat.mp3"], ["updated_at", "2015-08-16 12:01:59.206775"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_post
      @post = Post.friendly.find(params[:id])