app/controllers/profiles_controller.rb

  def show
    @posts = @profile.user.posts.where(:published => true).order('created_at DESC').page params[:page]
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."published" = ?  ORDER BY created_at DESC  [["user_id", 1], ["published", "t"]]

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("display_name", "bio", "image", "slug", "website", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "website" = ?, "image" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["website", "www.blog.com"], ["image", "something.jpg"], ["updated_at", "2015-08-16 13:42:13.277916"], ["id", 1]]

    def set_profile
      @profile = Profile.friendly.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT 1  [["id", 1]]